app/Controllers/AdminController.php

    public function orders()
    {
        $orderList =  new OrderModel();
        $data = [
            'data' => $orderList
                ->join('books', 'books.book_id = orders.book_id', 'left')
                ->join('users', 'users.id = orders.user_id','left')
                ->orderBy('id_order', 'DESC')
                ->paginate($this->perPages),
            'pager' => $orderList->pager,
            ];
---
SELECT *
FROM `orders`
LEFT JOIN `books` ON `books`.`book_id` = `orders`.`book_id`
LEFT JOIN `users` ON `users`.`id` = `orders`.`user_id`
ORDER BY `id_order` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `orders`
LEFT JOIN `books` ON `books`.`book_id` = `orders`.`book_id`
LEFT JOIN `users` ON `users`.`id` = `orders`.`user_id`