app/Controllers/BookController.php

    public function index($categories = null):string
    {
        $perPage = 10;
        $model = new BookModel();

        $model->select('books.book_id,
                 books.title,
                 books.description,
                 books.isbn,
                 books.img,
                 books.pages,
                 books.publish_date,
                 books.amount,
                 GROUP_CONCAT(authors.name,\' \', authors.surname ORDER BY authors.name SEPARATOR \', \') as authors')
                ->join('book_author', 'books.book_id = book_author.book_id', 'LEFT')
                ->join('authors', 'authors.author_id = book_author.author_id', 'LEFT')
                ->join('book_categories', 'books.book_id = book_categories.book_id', 'LEFT')
                ->groupBy(array('books.book_id', 'books.title'))
                ->orderBy('book_id','DESC')

        ;
        if(isset($categories))
            $model->where('book_categories.category_id', $categories);

        $data = [
            'data' => $model->paginate(10),
            'pager' => $model->pager,

        ];
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT `books`.`book_id`, `books`.`title`, `books`.`description`, `books`.`isbn`, `books`.`img`, `books`.`pages`, `books`.`publish_date`, `books`.`amount`, GROUP_CONCAT(authors.name, ' ', authors.surname ORDER BY authors.name SEPARATOR ', ') as authors
FROM `books`
LEFT JOIN `book_author` ON `books`.`book_id` = `book_author`.`book_id`
LEFT JOIN `authors` ON `authors`.`author_id` = `book_author`.`author_id`
LEFT JOIN `book_categories` ON `books`.`book_id` = `book_categories`.`book_id`
GROUP BY `books`.`book_id`, `books`.`title`
) CI_count_all_results