app/Controllers/CategoryController.php

    public function index()
    {
        $model = new CategoryModel();
        $data['data'] = $model->findAll();
---
SELECT *
FROM `categories`