app/Controllers/RecommendationController.php

    public function index(){
        $model = new RatingModel();
        $results = $model->where('user_id',4)->findAll();
---
SELECT *
FROM `ratings`
WHERE `user_id` = 4

    public function getPredict($book_id, $score_val)
    {
        #https://github.com/phpjuice/opencf

        # TRANSFORM OBJECT TO SUPPORTED ARRAY FOR OPEN CF
        $rating = new RatingModel();

        //get book title from ratings
        $books = $rating
            //->select('books.title, books.book_id')
           // ->join('books','books.book_id=ratings.book_id')
            ->groupBy('book_id')
            ->findAll();

        $dataset = array();

        foreach ($books as  $value) {

            //get score for each users
            $model = new RatingModel();
            $result = $model->select('user_id, score')->where('book_id', $value['book_id'])->findAll();
---
SELECT `user_id`, `score`
FROM `ratings`
WHERE `book_id` = '1'