app/Controllers/UserController.php

    public function index()
    {
        #nowy model z danymi
        $userModel = new UserModel();

        #wybieramy uzytkownika z id
        $data['user'] = $userModel->where('id', '7')->first();
---
SELECT *
FROM `users`
WHERE `id` = '4'
 LIMIT 1