app/Models/BookModel.php

    public function getBook($id){
        $bookModel = new BookModel();
        return $bookModel->where('book_id',$id)->first();
---
SELECT *
FROM `books`
WHERE `book_id` = 1
 LIMIT 1